---
kind: other
id: Methods.T:Autodesk.Revit.DB.TextElementType
source: html/20896d19-a2a3-35b9-104e-89107fb2098c.htm
---
# TextElementType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.